# Завдання 1
# У вас є словник, що описує книгу в бібліотеці. Інформація про видавництво
# зберігається у вкладеному словнику. Ваше завдання — коректно витягти дані з
# обох рівнів словника.

book_profile = {
"title": "Основи програмування",
"author": "Іван Петренко",
"year": 2023,
"publisher_info": {
"name": "Наукова думка",
"city": "Київ"
}
}

# 1. Отримайте назву книги та ім'я її автора.
title = book_profile["title"]
author_name = book_profile["author"]
print(title, author_name)

# 2. Отримайте назву видавництва з вкладеного словника.
name_publisher = book_profile["publisher_info"]["name"]
print(name_publisher)

# 3. Напишіть код, який виводить інформацію у вигляді речення: Книга "[назва]" автора [автор] була видана у місті [місто].

# 4. Перевірте, чи є у словнику book_profile ключ "year". Якщо він є, виведіть його значення, якщо ні — повідомлення "Рік видання невідомий".



